In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922

In [8]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [12]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

In [13]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [14]:
df.to_numpy()

array([[ 0.18870391,  1.07051907, -1.0707756 ,  0.30528841],
       [-0.26792197,  0.23272676, -0.12595832, -0.60924174],
       [-1.21142636, -0.35030952, -0.48438523, -0.00669909],
       [-0.66012568,  0.12101745,  1.36712638, -1.47251004],
       [ 0.04474021, -1.78664928,  1.15127138,  0.6377404 ],
       [ 0.09890949, -0.86235124, -1.05424603, -0.44392241]])

In [15]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [17]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.301187 -0.262508 -0.036161 -0.264891
std    0.543731  0.985884  1.067249  0.750398
min   -1.211426 -1.786649 -1.070776 -1.472510
25%   -0.562075 -0.734341 -0.911781 -0.567912
50%   -0.111591 -0.114646 -0.305172 -0.225311
75%    0.085367  0.204799  0.831964  0.227292
max    0.188704  1.070519  1.367126  0.637740

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.188704   -0.267922   -1.211426   -0.660126    0.044740    0.098909
B    1.070519    0.232727   -0.350310    0.121017   -1.786649   -0.862351
C   -1.070776   -0.125958   -0.484385    1.367126    1.151271   -1.054246
D    0.305288   -0.609242   -0.006699   -1.472510    0.637740   -0.443922

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.305288 -1.070776  1.070519  0.188704
2013-01-02 -0.609242 -0.125958  0.232727 -0.267922
2013-01-03 -0.006699 -0.484385 -0.350310 -1.211426
2013-01-04 -1.472510  1.367126  0.121017 -0.660126
2013-01-05  0.637740  1.151271 -1.786649  0.044740
2013-01-06 -0.443922 -1.054246 -0.862351  0.098909

In [20]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-01  0.188704  1.070519 -1.070776  0.305288

In [21]:
df["A"]

2013-01-01    0.188704
2013-01-02   -0.267922
2013-01-03   -1.211426
2013-01-04   -0.660126
2013-01-05    0.044740
2013-01-06    0.098909
Freq: D, Name: A, dtype: float64

In [22]:
df[0:3]

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699

In [23]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -0.267922  0.232727 -0.125958 -0.609242
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699
2013-01-04 -0.660126  0.121017  1.367126 -1.472510

In [24]:
df.loc[dates[0]]

A    0.188704
B    1.070519
C   -1.070776
D    0.305288
Name: 2013-01-01 00:00:00, dtype: float64

In [25]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.188704  1.070519
2013-01-02 -0.267922  0.232727
2013-01-03 -1.211426 -0.350310
2013-01-04 -0.660126  0.121017
2013-01-05  0.044740 -1.786649
2013-01-06  0.098909 -0.862351

In [26]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -0.267922  0.232727
2013-01-03 -1.211426 -0.350310
2013-01-04 -0.660126  0.121017

In [27]:
df.loc[dates[0], "A"]

np.float64(0.18870391139808018)

In [28]:
df.iloc[3]

A   -0.660126
B    0.121017
C    1.367126
D   -1.472510
Name: 2013-01-04 00:00:00, dtype: float64

In [29]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.660126  0.121017
2013-01-05  0.044740 -1.786649

In [30]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.267922 -0.125958
2013-01-03 -1.211426 -0.484385
2013-01-05  0.044740  1.151271

In [31]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.070519 -1.070776
2013-01-02  0.232727 -0.125958
2013-01-03 -0.350310 -0.484385
2013-01-04  0.121017  1.367126
2013-01-05 -1.786649  1.151271
2013-01-06 -0.862351 -1.054246

In [32]:
df.iloc[1, 1]

np.float64(0.23272676067472117)

In [33]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.188704  1.070519 -1.070776  0.305288
2013-01-05  0.044740 -1.786649  1.151271  0.637740
2013-01-06  0.098909 -0.862351 -1.054246 -0.443922

In [34]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.188704  1.070519       NaN  0.305288
2013-01-02       NaN  0.232727       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN
2013-01-04       NaN  0.121017  1.367126       NaN
2013-01-05  0.044740       NaN  1.151271  0.637740
2013-01-06  0.098909       NaN       NaN       NaN

In [35]:
df2 = df.copy()

In [37]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [38]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03 -1.211426 -0.350310 -0.484385 -0.006699   two
2013-01-05  0.044740 -1.786649  1.151271  0.637740  four

In [39]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [40]:
df["F"] = s1

In [41]:
df.at[dates[0], "A"] = 0

In [42]:
df.iat[0, 1] = 0

In [43]:
df.loc[:, "D"] = np.array([5] * len(df))

In [44]:
df2 = df.copy()

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])

In [46]:
df1.loc[dates[0] : dates[1], "E"] = 1

In [47]:
df1

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.070776  5.0  NaN  1.0
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0
2013-01-03 -1.211426 -0.350310 -0.484385  5.0  2.0  NaN
2013-01-04 -0.660126  0.121017  1.367126  5.0  3.0  NaN

In [48]:
df1.dropna(how="any")

                   A         B         C    D    F    E
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0

In [49]:
df1.fillna(value=5)

                   A         B         C    D    F    E
2013-01-01  0.000000  0.000000 -1.070776  5.0  5.0  1.0
2013-01-02 -0.267922  0.232727 -0.125958  5.0  1.0  1.0
2013-01-03 -1.211426 -0.350310 -0.484385  5.0  2.0  5.0
2013-01-04 -0.660126  0.121017  1.367126  5.0  3.0  5.0

In [50]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [51]:
df.mean()

A   -0.332637
B   -0.440928
C   -0.036161
D    5.000000
F    3.000000
dtype: float64

In [52]:
df.mean(axis=1)

2013-01-01    0.982306
2013-01-02    1.167769
2013-01-03    0.990776
2013-01-04    1.765604
2013-01-05    1.681872
2013-01-06    1.636462
Freq: D, dtype: float64

In [53]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)

In [54]:
df.sub(s, axis="index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -2.211426 -1.350310 -1.484385  4.0  1.0
2013-01-04 -3.660126 -2.878983 -1.632874  2.0  0.0
2013-01-05 -4.955260 -6.786649 -3.848729  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [55]:
df.agg(lambda x: np.mean(x) * 5.6)

A    -1.862769
B    -2.469195
C    -0.202503
D    28.000000
F    16.800000
dtype: float64

In [56]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D      F
2013-01-01    0.000000    0.000000 -108.362491  506.0    NaN
2013-01-02  -27.113703   23.551948  -12.746982  506.0  101.2
2013-01-03 -122.596348  -35.451324  -49.019785  506.0  202.4
2013-01-04  -66.804718   12.246966  138.353190  506.0  303.6
2013-01-05    4.527710 -180.808908  116.508663  506.0  404.8
2013-01-06   10.009640  -87.269945 -106.689698  506.0  506.0

In [57]:
s = pd.Series(np.random.randint(0, 7, size=10))